spec/support/mvi/find_candidate_response_no_prolog.xml

<env:Envelope xmlns:env="http://schemas.xmlsoap.org/soap/envelope/" xmlns:soapenc="http://schemas.xmlsoap.org/soap/encoding/" xmlns:xsd="http://www.w3.org/2001/XMLSchema" xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance">
  <env:Header/>
  <env:Body>
    <idm:PRPA_IN201306UV02 ITSVersion="XML_1.0" xmlns="urn:hl7-org:v3" xmlns:idm="http://vaww.oed.oit.va.gov" xsi:schemaLocation="urn:hl7-org:v3 ../../schema/HL7V3/NE2008/multicacheschemas/PRPA_IN201306UV02.xsd">
      <id extension="WSDOC1610291958075781359595189" root="2.16.840.1.113883.4.349"/>
      <creationTime value="20161029195807"/>
      <versionCode code="3.0"/>
      <interactionId extension="PRPA_IN201306UV02" root="2.16.840.1.113883.1.6"/>
      <processingCode code="T"/>
      <processingModeCode code="T"/>
      <acceptAckCode code="NE"/>
      <receiver typeCode="RCV">
        <device classCode="DEV" determinerCode="INSTANCE">
          <id extension="200VGOV" root="2.16.840.1.113883.4.349"/>
        </device>
      </receiver>
      <sender typeCode="SND">
        <device classCode="DEV" determinerCode="INSTANCE">
          <id extension="200M" root="2.16.840.1.113883.4.349"/>
        </device>
      </sender>
      <acknowledgement>
        <typeCode code="AA"/>
        <targetMessage>
          <id extension="200VGOV-68e5a41d-e627-4727-8b92-e2dffb8d8674" root="1.2.840.114350.1.13.0.1.7.1.1"/>
        </targetMessage>
        <acknowledgementDetail>
          <code code="132" codeSystemName="MVI" displayName="IMT"/>
          <text>Identity Match Threshold</text>
        </acknowledgementDetail>
        <acknowledgementDetail>
          <code code="120" codeSystemName="MVI" displayName="PDT"/>
          <text>Potential Duplicate Threshold</text>
        </acknowledgementDetail>
      </acknowledgement>
      <controlActProcess classCode="CACT" moodCode="EVN">
        <code code="PRPA_TE201306UV02" codeSystem="2.16.840.1.113883.1.6"/>
        <subject typeCode="SUBJ">
          <registrationEvent classCode="REG" moodCode="EVN">
            <id nullFlavor="NA"/>
            <statusCode code="active"/>
            <subject1 typeCode="SBJ">
              <patient classCode="PAT">
                <id extension="1008711094V567547^NI^200M^USVHA^P" root="2.16.840.1.113883.4.349"/>
                <id extension="796127160^PI^200BRLS^USVBA^A" root="2.16.840.1.113883.4.349"/>
                <id extension="32318174^PI^200CORP^USVBA^A" root="2.16.840.1.113883.4.349"/>
                <statusCode code="active"/>
                <patientPerson>
                  <name use="L">
                    <given>KENT</given>
                    <given>L</given>
                    <family>WARREN</family>
                  </name>
                  <administrativeGenderCode code="M"/>
                  <asOtherIDs classCode="SSN">
                    <id extension="796127160" root="2.16.840.1.113883.4.1"/>
                    <scopingOrganization classCode="ORG" determinerCode="INSTANCE">
                      <id root="1.2.840.114350.1.13.99997.2.3412"/>
                    </scopingOrganization>
                  </asOtherIDs>
                </patientPerson>
                <subjectOf1>
                  <queryMatchObservation classCode="COND" moodCode="EVN">
                    <code code="IHE_PDQ"/>
                    <value value="169" xsi:type="INT"/>
                  </queryMatchObservation>
                </subjectOf1>
              </patient>
            </subject1>
            <custodian typeCode="CST">
              <assignedEntity classCode="ASSIGNED">
                <id root="2.16.840.1.113883.4.349"/>
              </assignedEntity>
            </custodian>
          </registrationEvent>
        </subject>
        <queryAck>
          <queryId extension="18204" root="1.2.840.114350.1.13.28.1.18.5.999"/>
          <queryResponseCode code="OK"/>
          <resultCurrentQuantity value="1"/>
        </queryAck>
        <queryByParameter>
          <queryId extension="18204" root="1.2.840.114350.1.13.28.1.18.5.999"/>
          <statusCode code="new"/>
          <modifyCode code="MVI.COMP1"/>
          <initialQuantity value="1"/>
          <parameterList>
            <livingSubjectAdministrativeGender>
              <value code="M"/>
              <semanticsText>Gender</semanticsText>
            </livingSubjectAdministrativeGender>
            <livingSubjectBirthTime>
              <value value="19360714"/>
              <semanticsText>Date of Birth</semanticsText>
            </livingSubjectBirthTime>
            <livingSubjectId>
              <value extension="796127160" root="2.16.840.1.113883.4.1"/>
              <semanticsText>SSN</semanticsText>
            </livingSubjectId>
            <livingSubjectName>
              <value use="L">
                <given>KENT</given>
                <given>L</given>
                <family>WARREN</family>
              </value>
              <semanticsText>Legal Name</semanticsText>
            </livingSubjectName>
          </parameterList>
        </queryByParameter>
      </controlActProcess>
    </idm:PRPA_IN201306UV02>
  </env:Body>
</env:Envelope>
