spec/support/mpi/find_candidate_no_subject_response.xml

<?xml version="1.0" encoding="UTF-8"?>
<env:Envelope xmlns:env="http://schemas.xmlsoap.org/soap/envelope/" xmlns:soapenc="http://schemas.xmlsoap.org/soap/encoding/" xmlns:xsd="http://www.w3.org/2001/XMLSchema" xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance">
  <env:Header/>
  <env:Body>
    <idm:PRPA_IN201306UV02 ITSVersion="XML_1.0" xmlns="urn:hl7-org:v3" xmlns:idm="http://vaww.oed.oit.va.gov" xsi:schemaLocation="urn:hl7-org:v3 ../../schema/HL7V3/NE2008/multicacheschemas/PRPA_IN201306UV02.xsd">
      <id extension="WSDOC1610281506526980946641502" root="2.16.840.1.113883.4.349"/>
      <creationTime value="20161028150652"/>
      <versionCode code="3.0"/>
      <interactionId extension="PRPA_IN201306UV02" root="2.16.840.1.113883.1.6"/>
      <processingCode code="T"/>
      <processingModeCode code="T"/>
      <acceptAckCode code="NE"/>
      <receiver typeCode="RCV">
        <device classCode="DEV" determinerCode="INSTANCE">
          <id extension="200VGOV" root="2.16.840.1.113883.4.349"/>
        </device>
      </receiver>
      <sender typeCode="SND">
        <device classCode="DEV" determinerCode="INSTANCE">
          <id extension="200M" root="2.16.840.1.113883.4.349"/>
        </device>
      </sender>
      <acknowledgement>
        <typeCode code="AA"/>
        <targetMessage>
          <id extension="200VGOV-2588acd0-f28d-461b-bf66-307dec8f241b" root="1.2.840.114350.1.13.0.1.7.1.1"/>
        </targetMessage>
        <acknowledgementDetail>
          <code code="132" codeSystemName="MVI" displayName="IMT"/>
          <text>Identity Match Threshold</text>
        </acknowledgementDetail>
        <acknowledgementDetail>
          <code code="120" codeSystemName="MVI" displayName="PDT"/>
          <text>Potential Duplicate Threshold</text>
        </acknowledgementDetail>
      </acknowledgement>
      <controlActProcess classCode="CACT" moodCode="EVN">
        <code code="PRPA_TE201306UV02" codeSystem="2.16.840.1.113883.1.6"/>
        <queryAck>
          <queryId extension="18204" root="1.2.840.114350.1.13.28.1.18.5.999"/>
          <queryResponseCode code="NF"/>
          <resultCurrentQuantity value="0"/>
        </queryAck>
        <queryByParameter>
          <queryId extension="18204" root="1.2.840.114350.1.13.28.1.18.5.999"/>
          <statusCode code="new"/>
          <modifyCode code="MVI.COMP1"/>
          <initialQuantity value="1"/>
          <parameterList>
            <livingSubjectAdministrativeGender>
              <value code="M"/>
              <semanticsText>Gender</semanticsText>
            </livingSubjectAdministrativeGender>
            <livingSubjectBirthTime>
              <value value="19780611"/>
              <semanticsText>Date of Birth</semanticsText>
            </livingSubjectBirthTime>
            <livingSubjectId>
              <value extension="796188587" root="2.16.840.1.113883.4.1"/>
              <semanticsText>SSN</semanticsText>
            </livingSubjectId>
            <livingSubjectName>
              <value use="L">
                <given>EARL</given>
                <given>M</given>
                <family>STEPHENS</family>
              </value>
              <semanticsText>Legal Name</semanticsText>
            </livingSubjectName>
          </parameterList>
        </queryByParameter>
      </controlActProcess>
    </idm:PRPA_IN201306UV02>
  </env:Body>
</env:Envelope>
