config/mpi_schema/mpi_add_person_template.xml

<?xml version="1.0" encoding="utf-8"?>
<soap:Envelope xmlns:soap="http://schemas.xmlsoap.org/soap/envelope/" xmlns:soapenc="http://schemas.xmlsoap.org/soap/encoding/" xmlns:xsd="http://www.w3.org/2001/XMLSchema" xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance">
  <soap:Body>
    <idm:PRPA_IN201301UV02 xmlns:idm="http://vaww.oed.oit.va.gov" xmlns:xsi="http://www.w3.org/2001/XMLSchema‐instance" xsi:schemaLocation="urn:hl7‐org:v3 ../../schema/HL7V3/NE2008/multicacheschemas/PRPA_IN201305UV02.xsd" xmlns="urn:hl7‐org:v3" ITSVersion="XML_1.0">      <id extension="{{ msg_id }}" root="22a0f9e0-4454-11dc-a6be-3603d6866807"/>
      <creationTime value="{{ date_of_request }}"/>
      <versionCode code="4.1"/>
      <interactionId extension="PRPA_IN201301UV02" root="2.16.840.1.113883.1.6"/>
      <processingCode code="{{ processing_code }}"/>
      <processingModeCode code="T"/>
      <acceptAckCode code="AL"/>
      <receiver typeCode="RCV">
        <device determinerCode="INSTANCE" classCode="DEV">
          <id root="2.16.840.1.113883.4.349"/>
        </device>
      </receiver>
      <sender typeCode="SND">
        <device determinerCode="INSTANCE" classCode="DEV">
          <id extension="200VGOV" root="2.16.840.1.113883.4.349"/>
        </device>
      </sender>
      <attentionLine>
        <keyWordText>Search.Token</keyWordText>
        <value xsi:type="ST">{{ search_token }}</value>
      </attentionLine>
      <controlActProcess classCode="CACT" moodCode="EVN">
        <dataEnterer contextControlCode="AP" typeCode="ENT">
          <assignedPerson classCode="ASSIGNED">
            <id extension="{{ user_identity }}" root="2.16.840.1.113883.4.349"/>
            <assignedPerson determinerCode="INSTANCE" classCode="PSN">
              <name>
                <given>{{ first_name }}</given>
                <family>{{ last_name }}</family>
              </name>
            </assignedPerson>
            <representedOrganization determinerCode="INSTANCE" classCode="ORG">
              <id extension="dslogon.{{ edipi }}" root="2.16.840.1.113883.4.349"/>
              <code code="{{ current_datetime }}"/>
              <desc>vagov</desc>
              <telecom value="{{ ip_address }}"/>
            </representedOrganization>
          </assignedPerson>
        </dataEnterer>
        <subject typeCode="SUBJ">
          <registrationEvent classCode="REG" moodCode="EVN">
            <id nullFlavor="NA"/>
            <statusCode code="active"/>
            <subject1 typeCode="SBJ">
              <patient classCode="PAT">
                <id extension="{{ user_identity }}" root="2.16.840.1.113883.4.349"/>
                <statusCode code="active"/>
                <patientPerson>
                  <name use="L">
                    <given>{{ first_name}}</given>
                    <family>{{ last_name }}</family>
                  </name>
                  <birthTime value="{{ date_of_birth }}"/>
                  <asOtherIDs classCode="SSN">
                    <id extension="{{ ssn }}" root="2.16.840.1.113883.4.1"/>
                    <scopingOrganization determinerCode="INSTANCE" classCode="ORG">
                      <id root="2.16.840.1.113883.4.1"/>
                    </scopingOrganization>
                  </asOtherIDs>
                  <asOtherIDs classCode="PAT">
                    <id extension="PROXY_ADD^PI^200VBA^USVBA" root="2.16.840.1.113883.4.349"/>
                    <scopingOrganization determinerCode="INSTANCE" classCode="ORG">
                      <id extension="VBA" root="2.16.840.1.113883.4.349"/>
                      <name>MVI.ORCHESTRATION</name>
                    </scopingOrganization>
                  </asOtherIDs>
                </patientPerson>
                <providerOrganization determinerCode="INSTANCE" classCode="ORG">
                  <id root="2.16.840.1.113883.3.933"/>
                  <name>Good Health Clinic</name>
                  <contactParty classCode="CON">
                    <telecom value="3425558394"/>
                  </contactParty>
                </providerOrganization>
              </patient>
            </subject1>
            <custodian typeCode="CST">
              <assignedEntity classCode="ASSIGNED">
                <id root="2.16.840.1.113883.3.933"/>
                <assignedOrganization determinerCode="INSTANCE" classCode="ORG">
                  <name>Good Health Clinic</name>
                </assignedOrganization>
              </assignedEntity>
            </custodian>
          </registrationEvent>
        </subject>
      </controlActProcess>
    </idm:PRPA_IN201301UV02>
  </soap:Body>
</soap:Envelope>
